{
    "</SMILES>": 151687,
    "</box>": 151677,
    "</dna>": 151691,
    "</img>": 151671,
    "</protein>": 151689,
    "</quad>": 151673,
    "</ref>": 151675,
    "</rna>": 151693,
    "</think>": 151668,
    "</tool_call>": 151658,
    "</tool_response>": 151666,
    "<IMG_CONTEXT>": 151669,
    "<SMILES>": 151686,
    "<TS_CONTEXT>": 151685,
    "<box>": 151676,
    "<dna>": 151690,
    "<img>": 151670,
    "<protein>": 151688,
    "<quad>": 151672,
    "<ref>": 151674,
    "<rna>": 151692,
    "<think>": 151667,
    "<tool_call>": 151657,
    "<tool_response>": 151665,
    "<video>": 151682,
    "<|/ts|>": 151684,
    "<|action_end|>": 151679,
    "<|action_start|>": 151678,
    "<|box_end|>": 151649,
    "<|box_start|>": 151648,
    "<|endoftext|>": 151643,
    "<|file_sep|>": 151664,
    "<|fim_middle|>": 151660,
    "<|fim_pad|>": 151662,
    "<|fim_prefix|>": 151659,
    "<|fim_suffix|>": 151661,
    "<|im_end|>": 151645,
    "<|im_start|>": 151644,
    "<|image_pad|>": 151655,
    "<|interpreter|>": 151680,
    "<|object_ref_end|>": 151647,
    "<|object_ref_start|>": 151646,
    "<|plugin|>": 151681,
    "<|quad_end|>": 151651,
    "<|quad_start|>": 151650,
    "<|repo_name|>": 151663,
    "<|ts|>": 151683,
    "<|video_pad|>": 151656,
    "<|vision_end|>": 151653,
    "<|vision_pad|>": 151654,
    "<|vision_start|>": 151652
}