{
  "architectures": [
    "InternS1ProForConditionalGeneration"
  ],
  "image_token_id": 151655,
  "model_type": "interns1_pro",
  "text_config": {
    "attention_bias": false,
    "attention_dropout": 0.0,
    "bos_token_id": 151643,
    "decoder_sparse_step": 1,
    "dtype": "bfloat16",
    "eos_token_id": 151645,
    "head_dim": 128,
    "hidden_act": "silu",
    "hidden_size": 4096,
    "initializer_range": 0.02,
    "intermediate_size": 12288,
    "max_position_embeddings": 262144,
    "mlp_only_layers": [],
    "model_type": "interns1_pro_text",
    "moe_intermediate_size": 1536,
    "norm_topk_prob": true,
    "num_attention_heads": 64,
    "num_experts": 512,
    "num_experts_per_tok": 8,
    "num_hidden_layers": 94,
    "num_key_value_heads": 4,
    "rms_norm_eps": 1e-06,
    "rope_scaling": {
      "rope_type": "default",
      "fope_init_factor": 0.5,
      "fope_sep_head": true,
      "num_inv_freq": null
    },
    "rope_theta": 5000000,
    "router_n_groups": 8,
    "use_cache": true,
    "vocab_size": 155008
  },
  "tie_word_embeddings": false,
  "transformers_version": "4.57.0.dev0",
  "video_token_id": 151656,
  "vision_config": {
    "depth": 24,
    "hidden_act": "gelu_pytorch_tanh",
    "hidden_size": 1024,
    "in_channels": 3,
    "initializer_range": 0.02,
    "intermediate_size": 4096,
    "model_type": "interns1_pro_vision",
    "num_heads": 16,
    "num_position_embeddings": 2304,
    "out_hidden_size": 4096,
    "patch_size": 16,
    "spatial_merge_size": 2,
    "temporal_patch_size": 2
  },
  "vision_end_token_id": 151653,
  "vision_start_token_id": 151652,
  "auto_map": {
    "AutoConfig": "configuration_interns1_pro.InternS1ProConfig",
    "AutoModel": "modeling_interns1_pro.InternS1ProModel",
    "AutoModelForCausalLM": "modeling_interns1_pro.InternS1ProForConditionalGeneration"
  },
  "quantization_config": {
    "activation_scheme": "dynamic",
    "fmt": "e4m3",
    "quant_method": "fp8",
    "scale_fmt": "ue8m0",
    "weight_block_size": [
      128,
      128
    ],
    "modules_to_not_convert": [
      "model.language_model.layers.23.self_attn.k_norm",
      "model.language_model.layers.30.post_attention_layernorm",
      "model.language_model.layers.31.mlp.gate",
      "model.language_model.layers.7.self_attn.q_norm",
      "model.language_model.layers.42.self_attn.q_norm",
      "model.language_model.layers.71.self_attn.k_norm",
      "model.language_model.layers.5.post_attention_layernorm",
      "model.language_model.layers.24.post_attention_layernorm",
      "model.visual.blocks.19.norm1",
      "model.language_model.layers.23.mlp.gate",
      "model.language_model.layers.78.post_attention_layernorm",
      "model.visual.blocks.4.attn.proj",
      "model.language_model.layers.58.self_attn.k_norm",
      "model.visual.blocks.4.attn.qkv",
      "model.language_model.layers.27.post_attention_layernorm",
      "model.language_model.layers.92.mlp.gate",
      "model.language_model.layers.30.self_attn.k_norm",
      "model.visual.blocks.20.mlp.linear_fc2",
      "model.language_model.layers.25.input_layernorm",
      "model.language_model.layers.12.self_attn.q_norm",
      "model.visual.blocks.0.attn.proj",
      "model.language_model.layers.56.self_attn.k_norm",
      "model.language_model.layers.69.mlp.gate",
      "model.language_model.layers.82.mlp.gate",
      "model.visual.blocks.11.norm1",
      "model.visual.blocks.17.mlp.linear_fc2",
      "model.language_model.layers.51.post_attention_layernorm",
      "model.visual.blocks.16.norm1",
      "model.language_model.layers.93.post_attention_layernorm",
      "model.language_model.layers.36.mlp.gate",
      "model.visual.blocks.15.mlp.linear_fc2",
      "model.language_model.layers.78.self_attn.q_norm",
      "model.language_model.layers.6.input_layernorm",
      "model.language_model.layers.71.input_layernorm",
      "model.language_model.layers.74.input_layernorm",
      "model.language_model.layers.77.mlp.gate",
      "model.visual.blocks.13.attn.proj",
      "model.language_model.layers.52.post_attention_layernorm",
      "model.language_model.layers.56.post_attention_layernorm",
      "model.language_model.layers.39.self_attn.q_norm",
      "model.language_model.layers.37.input_layernorm",
      "model.visual.blocks.13.attn.qkv",
      "model.visual.blocks.16.norm2",
      "model.visual.blocks.16.attn.proj",
      "model.language_model.layers.59.post_attention_layernorm",
      "model.language_model.layers.0.mlp.gate",
      "model.language_model.layers.11.mlp.gate",
      "model.language_model.layers.37.post_attention_layernorm",
      "model.language_model.layers.29.mlp.gate",
      "model.visual.blocks.14.mlp.linear_fc1",
      "model.language_model.layers.37.mlp.gate",
      "model.language_model.layers.84.mlp.gate",
      "model.language_model.layers.43.mlp.gate",
      "model.language_model.layers.56.mlp.gate",
      "model.language_model.layers.12.post_attention_layernorm",
      "model.language_model.layers.8.post_attention_layernorm",
      "model.language_model.layers.83.mlp.gate",
      "model.visual.blocks.6.norm2",
      "model.language_model.layers.35.post_attention_layernorm",
      "model.language_model.layers.46.self_attn.q_norm",
      "model.visual.blocks.9.norm1",
      "model.language_model.layers.14.input_layernorm",
      "model.language_model.layers.61.mlp.gate",
      "model.visual.blocks.23.norm2",
      "model.language_model.layers.41.mlp.gate",
      "model.visual.blocks.17.mlp.linear_fc1",
      "model.visual.blocks.4.norm2",
      "model.visual.blocks.17.attn.qkv",
      "model.language_model.layers.83.self_attn.k_norm",
      "model.language_model.layers.47.post_attention_layernorm",
      "model.language_model.layers.59.input_layernorm",
      "model.language_model.layers.36.post_attention_layernorm",
      "model.language_model.layers.46.input_layernorm",
      "model.language_model.layers.46.post_attention_layernorm",
      "model.language_model.layers.83.input_layernorm",
      "model.language_model.layers.48.self_attn.k_norm",
      "model.visual.blocks.12.norm2",
      "model.visual.blocks.21.mlp.linear_fc1",
      "model.language_model.layers.34.mlp.gate",
      "model.language_model.layers.10.self_attn.k_norm",
      "model.language_model.layers.12.mlp.gate",
      "model.language_model.layers.42.self_attn.k_norm",
      "model.language_model.layers.40.mlp.gate",
      "model.visual.blocks.8.norm2",
      "model.language_model.layers.90.post_attention_layernorm",
      "model.visual.blocks.23.norm1",
      "model.language_model.layers.20.self_attn.q_norm",
      "model.visual.blocks.11.attn.proj",
      "model.visual.blocks.19.attn.qkv",
      "model.language_model.layers.49.input_layernorm",
      "model.language_model.layers.49.self_attn.q_norm",
      "model.visual.blocks.12.norm1",
      "model.language_model.layers.76.post_attention_layernorm",
      "model.language_model.layers.17.self_attn.k_norm",
      "model.language_model.layers.57.self_attn.k_norm",
      "model.visual.blocks.9.attn.qkv",
      "model.visual.blocks.16.attn.qkv",
      "model.language_model.layers.88.self_attn.k_norm",
      "model.language_model.layers.62.post_attention_layernorm",
      "model.language_model.layers.87.self_attn.k_norm",
      "model.language_model.layers.4.input_layernorm",
      "model.visual.blocks.22.attn.proj",
      "model.language_model.layers.73.mlp.gate",
      "model.language_model.layers.1.mlp.gate",
      "model.visual.blocks.6.mlp.linear_fc1",
      "model.language_model.layers.25.self_attn.k_norm",
      "model.language_model.layers.22.self_attn.q_norm",
      "model.language_model.layers.32.input_layernorm",
      "model.visual.blocks.10.norm1",
      "model.visual.blocks.2.mlp.linear_fc1",
      "model.language_model.layers.52.self_attn.q_norm",
      "model.language_model.layers.88.mlp.gate",
      "model.visual.blocks.8.attn.qkv",
      "model.language_model.layers.27.self_attn.q_norm",
      "model.language_model.layers.1.input_layernorm",
      "model.language_model.layers.41.self_attn.k_norm",
      "model.language_model.layers.87.self_attn.q_norm",
      "model.language_model.layers.55.post_attention_layernorm",
      "model.visual.blocks.13.mlp.linear_fc2",
      "model.visual.blocks.18.norm2",
      "model.language_model.layers.54.post_attention_layernorm",
      "model.visual.blocks.20.mlp.linear_fc1",
      "model.language_model.layers.66.mlp.gate",
      "model.language_model.layers.58.mlp.gate",
      "model.language_model.layers.31.self_attn.k_norm",
      "model.visual.blocks.22.attn.qkv",
      "model.language_model.layers.38.input_layernorm",
      "model.language_model.layers.93.mlp.gate",
      "model.language_model.layers.20.self_attn.k_norm",
      "model.language_model.layers.75.self_attn.q_norm",
      "model.language_model.layers.75.input_layernorm",
      "model.visual.blocks.14.norm1",
      "model.language_model.layers.44.self_attn.k_norm",
      "model.visual.blocks.7.attn.proj",
      "model.language_model.layers.1.self_attn.k_norm",
      "model.language_model.layers.53.mlp.gate",
      "model.language_model.layers.81.post_attention_layernorm",
      "model.language_model.layers.53.post_attention_layernorm",
      "model.language_model.layers.93.self_attn.q_norm",
      "model.language_model.layers.6.post_attention_layernorm",
      "model.language_model.layers.77.input_layernorm",
      "model.visual.blocks.15.attn.qkv",
      "model.language_model.layers.28.input_layernorm",
      "model.visual.blocks.2.attn.proj",
      "model.visual.blocks.11.mlp.linear_fc1",
      "model.language_model.layers.57.post_attention_layernorm",
      "model.visual.blocks.18.mlp.linear_fc2",
      "model.visual.blocks.0.norm1",
      "model.language_model.layers.3.self_attn.k_norm",
      "model.visual.blocks.4.mlp.linear_fc1",
      "model.language_model.layers.1.post_attention_layernorm",
      "model.language_model.layers.82.post_attention_layernorm",
      "model.language_model.layers.77.self_attn.k_norm",
      "model.language_model.layers.5.self_attn.k_norm",
      "model.language_model.layers.17.self_attn.q_norm",
      "model.language_model.layers.63.self_attn.q_norm",
      "model.language_model.layers.30.input_layernorm",
      "model.language_model.layers.58.self_attn.q_norm",
      "model.language_model.layers.68.input_layernorm",
      "model.language_model.layers.12.input_layernorm",
      "model.language_model.layers.72.self_attn.k_norm",
      "model.language_model.layers.47.self_attn.q_norm",
      "model.language_model.layers.9.mlp.gate",
      "model.language_model.layers.57.input_layernorm",
      "model.language_model.layers.27.input_layernorm",
      "model.language_model.layers.43.self_attn.k_norm",
      "model.language_model.layers.50.self_attn.k_norm",
      "model.language_model.layers.76.self_attn.q_norm",
      "model.visual.blocks.13.norm1",
      "model.language_model.layers.54.self_attn.k_norm",
      "model.visual.blocks.0.attn.qkv",
      "model.visual.blocks.9.norm2",
      "model.visual.blocks.15.norm1",
      "model.visual.blocks.5.attn.proj",
      "model.language_model.layers.39.mlp.gate",
      "model.visual.blocks.0.mlp.linear_fc1",
      "model.language_model.layers.20.post_attention_layernorm",
      "model.language_model.layers.75.post_attention_layernorm",
      "model.visual.blocks.6.attn.qkv",
      "model.visual.blocks.8.mlp.linear_fc1",
      "model.visual.blocks.20.attn.proj",
      "model.visual.blocks.23.attn.qkv",
      "model.language_model.layers.39.self_attn.k_norm",
      "model.language_model.layers.27.self_attn.k_norm",
      "model.language_model.layers.21.self_attn.k_norm",
      "model.visual.blocks.19.norm2",
      "model.visual.blocks.17.norm2",
      "model.language_model.layers.10.self_attn.q_norm",
      "model.language_model.layers.6.self_attn.k_norm",
      "model.language_model.layers.37.self_attn.k_norm",
      "model.language_model.layers.18.mlp.gate",
      "model.language_model.layers.60.self_attn.k_norm",
      "model.language_model.layers.85.self_attn.k_norm",
      "model.language_model.layers.67.self_attn.k_norm",
      "model.visual.blocks.0.mlp.linear_fc2",
      "model.language_model.layers.76.input_layernorm",
      "model.visual.blocks.23.attn.proj",
      "model.language_model.layers.32.post_attention_layernorm",
      "model.language_model.layers.85.post_attention_layernorm",
      "model.language_model.layers.82.input_layernorm",
      "model.visual.blocks.8.norm1",
      "model.visual.blocks.15.mlp.linear_fc1",
      "model.language_model.layers.22.post_attention_layernorm",
      "model.language_model.layers.68.post_attention_layernorm",
      "model.language_model.layers.90.self_attn.k_norm",
      "lm_head",
      "model.language_model.layers.56.input_layernorm",
      "model.language_model.layers.74.self_attn.k_norm",
      "model.language_model.layers.42.post_attention_layernorm",
      "model.visual.blocks.20.norm2",
      "model.language_model.layers.51.self_attn.k_norm",
      "model.language_model.layers.70.post_attention_layernorm",
      "model.language_model.layers.20.input_layernorm",
      "model.language_model.layers.9.self_attn.k_norm",
      "model.language_model.layers.89.self_attn.q_norm",
      "model.language_model.layers.91.self_attn.k_norm",
      "model.visual.blocks.17.norm1",
      "model.language_model.layers.41.self_attn.q_norm",
      "model.language_model.layers.32.self_attn.q_norm",
      "model.language_model.layers.80.post_attention_layernorm",
      "model.language_model.layers.85.input_layernorm",
      "model.visual.blocks.13.mlp.linear_fc1",
      "model.visual.blocks.3.mlp.linear_fc2",
      "model.language_model.norm",
      "model.language_model.layers.22.input_layernorm",
      "model.language_model.layers.26.input_layernorm",
      "model.visual.blocks.23.mlp.linear_fc1",
      "model.language_model.layers.9.self_attn.q_norm",
      "model.language_model.layers.66.input_layernorm",
      "model.language_model.layers.52.input_layernorm",
      "model.language_model.layers.30.self_attn.q_norm",
      "model.language_model.layers.83.self_attn.q_norm",
      "model.language_model.layers.55.input_layernorm",
      "model.language_model.layers.41.post_attention_layernorm",
      "model.language_model.layers.88.input_layernorm",
      "model.language_model.layers.93.self_attn.k_norm",
      "model.visual.blocks.19.mlp.linear_fc1",
      "model.visual.blocks.21.norm2",
      "model.language_model.layers.33.mlp.gate",
      "model.language_model.layers.41.input_layernorm",
      "model.language_model.layers.77.post_attention_layernorm",
      "model.language_model.layers.2.post_attention_layernorm",
      "model.language_model.layers.45.input_layernorm",
      "model.visual.blocks.7.mlp.linear_fc1",
      "model.language_model.layers.40.self_attn.k_norm",
      "model.language_model.layers.35.self_attn.q_norm",
      "model.language_model.layers.72.post_attention_layernorm",
      "model.language_model.layers.13.post_attention_layernorm",
      "model.language_model.layers.81.input_layernorm",
      "model.language_model.layers.3.mlp.gate",
      "model.visual.blocks.5.norm2",
      "model.language_model.layers.62.self_attn.q_norm",
      "model.language_model.layers.91.input_layernorm",
      "model.language_model.layers.81.self_attn.k_norm",
      "model.language_model.layers.64.mlp.gate",
      "model.language_model.layers.81.mlp.gate",
      "model.language_model.layers.5.input_layernorm",
      "model.language_model.layers.75.mlp.gate",
      "model.language_model.layers.88.self_attn.q_norm",
      "model.language_model.layers.89.mlp.gate",
      "model.language_model.layers.59.mlp.gate",
      "model.language_model.layers.16.self_attn.k_norm",
      "model.language_model.layers.49.mlp.gate",
      "model.language_model.layers.59.self_attn.q_norm",
      "model.language_model.layers.21.mlp.gate",
      "model.language_model.layers.79.post_attention_layernorm",
      "model.visual.blocks.21.mlp.linear_fc2",
      "model.language_model.layers.34.self_attn.q_norm",
      "model.language_model.layers.34.input_layernorm",
      "model.language_model.layers.3.post_attention_layernorm",
      "model.language_model.rotary_emb",
      "model.language_model.layers.93.input_layernorm",
      "model.language_model.layers.17.mlp.gate",
      "model.visual.blocks.22.mlp.linear_fc1",
      "model.visual.blocks.12.attn.proj",
      "model.language_model.layers.34.post_attention_layernorm",
      "model.language_model.layers.48.post_attention_layernorm",
      "model.visual.blocks.15.attn.proj",
      "model.language_model.layers.90.mlp.gate",
      "model.visual.blocks.12.attn.qkv",
      "model.language_model.layers.56.self_attn.q_norm",
      "model.language_model.layers.40.input_layernorm",
      "model.language_model.layers.48.input_layernorm",
      "model.language_model.layers.29.self_attn.k_norm",
      "model.language_model.layers.40.self_attn.q_norm",
      "model.language_model.layers.45.self_attn.q_norm",
      "model.visual.blocks.21.attn.qkv",
      "model.language_model.layers.83.post_attention_layernorm",
      "model.language_model.layers.8.self_attn.q_norm",
      "model.language_model.layers.61.input_layernorm",
      "model.visual.blocks.16.mlp.linear_fc1",
      "model.language_model.layers.82.self_attn.q_norm",
      "model.language_model.layers.35.self_attn.k_norm",
      "model.visual.blocks.21.norm1",
      "model.visual.blocks.10.attn.proj",
      "model.language_model.layers.11.self_attn.q_norm",
      "model.language_model.layers.74.mlp.gate",
      "model.language_model.layers.85.mlp.gate",
      "model.language_model.layers.69.input_layernorm",
      "model.language_model.layers.38.mlp.gate",
      "model.visual.blocks.6.mlp.linear_fc2",
      "model.language_model.layers.44.input_layernorm",
      "model.language_model.layers.66.self_attn.q_norm",
      "model.language_model.layers.3.self_attn.q_norm",
      "model.language_model.layers.64.self_attn.k_norm",
      "model.visual.blocks.14.attn.qkv",
      "model.language_model.layers.8.input_layernorm",
      "model.language_model.layers.36.self_attn.q_norm",
      "model.language_model.layers.6.self_attn.q_norm",
      "model.language_model.layers.36.input_layernorm",
      "model.language_model.layers.55.mlp.gate",
      "model.language_model.layers.50.mlp.gate",
      "model.language_model.layers.18.input_layernorm",
      "model.language_model.layers.16.self_attn.q_norm",
      "model.language_model.layers.11.self_attn.k_norm",
      "model.visual.blocks.3.attn.proj",
      "model.language_model.layers.49.post_attention_layernorm",
      "model.language_model.layers.19.input_layernorm",
      "model.language_model.layers.73.input_layernorm",
      "model.visual.blocks.22.norm1",
      "model.language_model.layers.66.self_attn.k_norm",
      "model.language_model.layers.14.self_attn.k_norm",
      "model.visual.merger.linear_fc2",
      "model.language_model.layers.48.self_attn.q_norm",
      "model.visual.blocks.18.norm1",
      "model.language_model.layers.0.post_attention_layernorm",
      "model.language_model.layers.79.input_layernorm",
      "model.language_model.layers.81.self_attn.q_norm",
      "model.language_model.layers.47.input_layernorm",
      "model.language_model.layers.14.mlp.gate",
      "model.language_model.layers.35.mlp.gate",
      "model.language_model.layers.51.input_layernorm",
      "model.language_model.layers.16.input_layernorm",
      "model.language_model.layers.68.self_attn.q_norm",
      "model.language_model.layers.84.self_attn.q_norm",
      "model.visual.blocks.14.mlp.linear_fc2",
      "model.language_model.layers.14.post_attention_layernorm",
      "model.language_model.layers.42.mlp.gate",
      "model.language_model.layers.74.post_attention_layernorm",
      "model.language_model.layers.21.self_attn.q_norm",
      "model.language_model.layers.7.self_attn.k_norm",
      "model.language_model.layers.18.self_attn.k_norm",
      "model.language_model.layers.58.input_layernorm",
      "model.language_model.layers.18.self_attn.q_norm",
      "model.language_model.layers.80.self_attn.k_norm",
      "model.visual.blocks.9.mlp.linear_fc2",
      "model.language_model.layers.33.self_attn.k_norm",
      "model.language_model.layers.28.self_attn.k_norm",
      "model.visual.blocks.12.mlp.linear_fc2",
      "model.language_model.layers.72.self_attn.q_norm",
      "model.language_model.layers.36.self_attn.k_norm",
      "model.visual.blocks.7.norm1",
      "model.language_model.layers.26.self_attn.q_norm",
      "model.visual.merger.linear_fc1",
      "model.visual.blocks.6.attn.proj",
      "model.visual.blocks.4.norm1",
      "model.language_model.layers.69.self_attn.q_norm",
      "model.language_model.layers.39.post_attention_layernorm",
      "model.visual.blocks.10.attn.qkv",
      "model.visual.blocks.12.mlp.linear_fc1",
      "model.language_model.layers.29.self_attn.q_norm",
      "model.language_model.layers.37.self_attn.q_norm",
      "model.visual.blocks.3.norm1",
      "model.language_model.layers.5.self_attn.q_norm",
      "model.language_model.layers.34.self_attn.k_norm",
      "model.visual.blocks.5.attn.qkv",
      "model.language_model.layers.80.input_layernorm",
      "model.language_model.layers.2.mlp.gate",
      "model.visual.blocks.10.mlp.linear_fc1",
      "model.language_model.layers.19.post_attention_layernorm",
      "model.language_model.layers.78.self_attn.k_norm",
      "model.language_model.layers.57.self_attn.q_norm",
      "model.language_model.layers.39.input_layernorm",
      "model.language_model.layers.16.post_attention_layernorm",
      "model.language_model.layers.67.input_layernorm",
      "model.visual.blocks.13.norm2",
      "model.language_model.layers.0.self_attn.k_norm",
      "model.language_model.layers.3.input_layernorm",
      "model.language_model.layers.84.post_attention_layernorm",
      "model.language_model.layers.6.mlp.gate",
      "model.language_model.layers.17.input_layernorm",
      "model.visual.merger.norm",
      "model.visual.blocks.19.attn.proj",
      "model.language_model.layers.45.mlp.gate",
      "model.language_model.layers.70.mlp.gate",
      "model.language_model.layers.1.self_attn.q_norm",
      "model.language_model.layers.25.mlp.gate",
      "model.language_model.layers.47.mlp.gate",
      "model.language_model.layers.30.mlp.gate",
      "model.visual.blocks.22.mlp.linear_fc2",
      "model.language_model.layers.23.input_layernorm",
      "model.language_model.layers.92.input_layernorm",
      "model.visual.blocks.14.attn.proj",
      "model.language_model.layers.72.mlp.gate",
      "model.language_model.layers.78.mlp.gate",
      "model.language_model.layers.17.post_attention_layernorm",
      "model.language_model.layers.86.input_layernorm",
      "model.language_model.layers.24.self_attn.k_norm",
      "model.language_model.layers.86.self_attn.q_norm",
      "model.language_model.layers.86.mlp.gate",
      "model.language_model.layers.8.self_attn.k_norm",
      "model.language_model.layers.15.self_attn.q_norm",
      "model.language_model.layers.21.input_layernorm",
      "model.language_model.layers.43.post_attention_layernorm",
      "model.language_model.layers.72.input_layernorm",
      "model.language_model.layers.68.mlp.gate",
      "model.visual.blocks.21.attn.proj",
      "model.language_model.layers.8.mlp.gate",
      "model.language_model.layers.22.self_attn.k_norm",
      "model.language_model.layers.92.post_attention_layernorm",
      "model.visual.blocks.2.norm2",
      "model.language_model.layers.27.mlp.gate",
      "model.language_model.layers.26.mlp.gate",
      "model.language_model.layers.50.post_attention_layernorm",
      "model.language_model.layers.73.self_attn.q_norm",
      "model.language_model.layers.2.self_attn.k_norm",
      "model.language_model.layers.55.self_attn.k_norm",
      "model.visual.blocks.23.mlp.linear_fc2",
      "model.language_model.layers.31.self_attn.q_norm",
      "model.visual.blocks.9.mlp.linear_fc1",
      "model.language_model.layers.65.post_attention_layernorm",
      "model.language_model.layers.44.post_attention_layernorm",
      "model.language_model.layers.44.mlp.gate",
      "model.language_model.layers.59.self_attn.k_norm",
      "model.language_model.layers.4.self_attn.q_norm",
      "model.language_model.layers.7.post_attention_layernorm",
      "model.language_model.layers.67.post_attention_layernorm",
      "model.language_model.layers.11.post_attention_layernorm",
      "model.language_model.layers.90.input_layernorm",
      "model.visual.blocks.17.attn.proj",
      "model.language_model.layers.61.self_attn.k_norm",
      "model.visual.blocks.18.attn.proj",
      "model.visual.blocks.3.attn.qkv",
      "model.language_model.layers.10.input_layernorm",
      "model.visual.blocks.5.mlp.linear_fc1",
      "model.language_model.layers.33.post_attention_layernorm",
      "model.language_model.layers.24.self_attn.q_norm",
      "model.language_model.layers.31.post_attention_layernorm",
      "model.visual.blocks.6.norm1",
      "model.visual.blocks.15.norm2",
      "model.language_model.layers.57.mlp.gate",
      "model.language_model.layers.91.post_attention_layernorm",
      "model.language_model.layers.51.mlp.gate",
      "model.language_model.layers.84.self_attn.k_norm",
      "model.language_model.layers.89.input_layernorm",
      "model.visual.blocks.16.mlp.linear_fc2",
      "model.language_model.layers.38.post_attention_layernorm",
      "model.visual.blocks.1.mlp.linear_fc2",
      "model.language_model.layers.76.mlp.gate",
      "model.language_model.layers.24.mlp.gate",
      "model.language_model.layers.45.self_attn.k_norm",
      "model.language_model.layers.87.input_layernorm",
      "model.language_model.layers.38.self_attn.q_norm",
      "model.language_model.layers.63.input_layernorm",
      "model.language_model.layers.4.mlp.gate",
      "model.visual.blocks.2.mlp.linear_fc2",
      "model.language_model.layers.91.self_attn.q_norm",
      "model.language_model.layers.28.post_attention_layernorm",
      "model.language_model.layers.7.input_layernorm",
      "model.language_model.layers.63.mlp.gate",
      "model.language_model.layers.18.post_attention_layernorm",
      "model.language_model.layers.4.post_attention_layernorm",
      "model.language_model.layers.26.self_attn.k_norm",
      "model.language_model.layers.45.post_attention_layernorm",
      "model.language_model.layers.69.self_attn.k_norm",
      "model.language_model.layers.49.self_attn.k_norm",
      "model.language_model.layers.66.post_attention_layernorm",
      "model.visual.blocks.1.attn.qkv",
      "model.language_model.layers.31.input_layernorm",
      "model.visual.blocks.7.mlp.linear_fc2",
      "model.language_model.layers.15.mlp.gate",
      "model.visual.blocks.20.norm1",
      "model.language_model.layers.52.mlp.gate",
      "model.language_model.layers.58.post_attention_layernorm",
      "model.language_model.layers.54.input_layernorm",
      "model.language_model.layers.50.self_attn.q_norm",
      "model.language_model.layers.75.self_attn.k_norm",
      "model.language_model.embed_tokens",
      "model.language_model.layers.73.post_attention_layernorm",
      "model.language_model.layers.65.self_attn.q_norm",
      "model.language_model.layers.50.input_layernorm",
      "model.language_model.layers.60.post_attention_layernorm",
      "model.language_model.layers.70.input_layernorm",
      "model.language_model.layers.87.mlp.gate",
      "model.visual.blocks.11.attn.qkv",
      "model.visual.blocks.1.norm2",
      "model.language_model.layers.12.self_attn.k_norm",
      "model.visual.blocks.4.mlp.linear_fc2",
      "model.language_model.layers.78.input_layernorm",
      "model.language_model.layers.84.input_layernorm",
      "model.language_model.layers.29.post_attention_layernorm",
      "model.language_model.layers.32.mlp.gate",
      "model.language_model.layers.62.mlp.gate",
      "model.visual.blocks.11.mlp.linear_fc2",
      "model.language_model.layers.29.input_layernorm",
      "model.language_model.layers.13.input_layernorm",
      "model.language_model.layers.92.self_attn.k_norm",
      "model.language_model.layers.0.input_layernorm",
      "model.language_model.layers.86.post_attention_layernorm",
      "model.language_model.layers.25.self_attn.q_norm",
      "model.language_model.layers.79.self_attn.k_norm",
      "model.language_model.layers.23.post_attention_layernorm",
      "model.language_model.layers.33.self_attn.q_norm",
      "model.language_model.layers.79.self_attn.q_norm",
      "model.language_model.layers.80.self_attn.q_norm",
      "model.language_model.layers.67.self_attn.q_norm",
      "model.language_model.layers.86.self_attn.k_norm",
      "model.language_model.layers.88.post_attention_layernorm",
      "model.language_model.layers.68.self_attn.k_norm",
      "model.language_model.layers.53.self_attn.k_norm",
      "model.visual.blocks.2.attn.qkv",
      "model.language_model.layers.42.input_layernorm",
      "model.language_model.layers.53.input_layernorm",
      "model.visual.blocks.11.norm2",
      "model.language_model.layers.64.post_attention_layernorm",
      "model.visual.blocks.18.mlp.linear_fc1",
      "model.language_model.layers.9.post_attention_layernorm",
      "model.language_model.layers.14.self_attn.q_norm",
      "model.language_model.layers.33.input_layernorm",
      "model.language_model.layers.71.self_attn.q_norm",
      "model.visual.pos_embed",
      "model.language_model.layers.79.mlp.gate",
      "model.language_model.layers.19.mlp.gate",
      "model.language_model.layers.71.mlp.gate",
      "model.visual.patch_embed.proj",
      "model.visual.blocks.10.norm2",
      "model.visual.blocks.8.mlp.linear_fc2",
      "model.language_model.layers.71.post_attention_layernorm",
      "model.language_model.layers.40.post_attention_layernorm",
      "model.language_model.layers.24.input_layernorm",
      "model.language_model.layers.67.mlp.gate",
      "model.visual.blocks.14.norm2",
      "model.language_model.layers.46.mlp.gate",
      "model.language_model.layers.32.self_attn.k_norm",
      "model.language_model.layers.10.post_attention_layernorm",
      "model.language_model.layers.73.self_attn.k_norm",
      "model.language_model.layers.15.post_attention_layernorm",
      "model.language_model.layers.13.self_attn.k_norm",
      "model.visual.blocks.9.attn.proj",
      "model.visual.blocks.10.mlp.linear_fc2",
      "model.visual.blocks.2.norm1",
      "model.language_model.layers.20.mlp.gate",
      "model.language_model.layers.22.mlp.gate",
      "model.language_model.layers.70.self_attn.q_norm",
      "model.language_model.layers.54.self_attn.q_norm",
      "model.language_model.layers.92.self_attn.q_norm",
      "model.language_model.layers.70.self_attn.k_norm",
      "model.language_model.layers.47.self_attn.k_norm",
      "model.language_model.layers.64.self_attn.q_norm",
      "model.language_model.layers.4.self_attn.k_norm",
      "model.language_model.layers.62.self_attn.k_norm",
      "model.language_model.layers.65.input_layernorm",
      "model.language_model.layers.25.post_attention_layernorm",
      "model.language_model.layers.61.post_attention_layernorm",
      "model.language_model.layers.23.self_attn.q_norm",
      "model.language_model.layers.38.self_attn.k_norm",
      "model.language_model.layers.80.mlp.gate",
      "model.language_model.layers.54.mlp.gate",
      "model.visual.blocks.7.norm2",
      "model.language_model.layers.7.mlp.gate",
      "model.language_model.layers.0.self_attn.q_norm",
      "model.language_model.layers.48.mlp.gate",
      "model.language_model.layers.43.self_attn.q_norm",
      "model.visual.blocks.7.attn.qkv",
      "model.visual.blocks.3.norm2",
      "model.language_model.layers.5.mlp.gate",
      "model.language_model.layers.61.self_attn.q_norm",
      "model.language_model.layers.64.input_layernorm",
      "model.visual.blocks.20.attn.qkv",
      "model.language_model.layers.76.self_attn.k_norm",
      "model.language_model.layers.13.mlp.gate",
      "model.visual.blocks.1.norm1",
      "model.language_model.layers.53.self_attn.q_norm",
      "model.language_model.layers.52.self_attn.k_norm",
      "model.language_model.layers.89.post_attention_layernorm",
      "model.language_model.layers.90.self_attn.q_norm",
      "model.language_model.layers.13.self_attn.q_norm",
      "model.language_model.layers.28.self_attn.q_norm",
      "model.visual.blocks.22.norm2",
      "model.visual.blocks.5.mlp.linear_fc2",
      "model.language_model.layers.62.input_layernorm",
      "model.language_model.layers.21.post_attention_layernorm",
      "model.language_model.layers.55.self_attn.q_norm",
      "model.visual.blocks.0.norm2",
      "model.language_model.layers.19.self_attn.q_norm",
      "model.language_model.layers.19.self_attn.k_norm",
      "model.language_model.layers.44.self_attn.q_norm",
      "model.language_model.layers.74.self_attn.q_norm",
      "model.language_model.layers.26.post_attention_layernorm",
      "model.visual.blocks.1.mlp.linear_fc1",
      "model.visual.blocks.3.mlp.linear_fc1",
      "model.language_model.layers.63.post_attention_layernorm",
      "model.language_model.layers.69.post_attention_layernorm",
      "model.visual.blocks.5.norm1",
      "model.visual.blocks.18.attn.qkv",
      "model.language_model.layers.15.input_layernorm",
      "model.language_model.layers.77.self_attn.q_norm",
      "model.language_model.layers.2.input_layernorm",
      "model.language_model.layers.46.self_attn.k_norm",
      "model.language_model.layers.28.mlp.gate",
      "model.language_model.layers.65.self_attn.k_norm",
      "model.visual.blocks.1.attn.proj",
      "model.language_model.layers.89.self_attn.k_norm",
      "model.language_model.layers.35.input_layernorm",
      "model.language_model.layers.15.self_attn.k_norm",
      "model.language_model.layers.11.input_layernorm",
      "model.language_model.layers.60.input_layernorm",
      "model.language_model.layers.51.self_attn.q_norm",
      "model.language_model.layers.43.input_layernorm",
      "model.language_model.layers.87.post_attention_layernorm",
      "model.language_model.layers.63.self_attn.k_norm",
      "model.language_model.layers.9.input_layernorm",
      "model.visual.blocks.19.mlp.linear_fc2",
      "model.language_model.layers.65.mlp.gate",
      "model.language_model.layers.16.mlp.gate",
      "model.language_model.layers.85.self_attn.q_norm",
      "model.visual.blocks.8.attn.proj",
      "model.language_model.layers.2.self_attn.q_norm",
      "model.language_model.layers.10.mlp.gate",
      "model.language_model.layers.82.self_attn.k_norm",
      "model.language_model.layers.60.mlp.gate",
      "model.language_model.layers.91.mlp.gate",
      "model.language_model.layers.60.self_attn.q_norm"
    ]
  }
}
